/*
    
 Graph Input in a Bi-directional undirected graph (weighted)   
   কিভাবে গ্রাফে ইনপুট নিব
  এখানে একটি Bi-Directional গ্রাফে কিভাবে ইনপুট নিব সেটা দেখানো হয়েছে
  খুব সহজ , কতগুলো নোড লাগবে সেটা বললে ওই সাইজের একটা ২ ডাইমেনশনাল মেট্রিক্স এর মতো অ্যারে কল্পান করে 
  প্রত্যেকটা নোড থেকে আরেকটা নোডে যাওয়ার কস্ট বলে দিলেই হয়


*/


#include<iostream>
#include <stdio.h>
using namespace std;

int main()
{
    int N;
    int matrix[100][100]; //এই সর্বোচ্চ ১০০ নোডের গ্রাফ স্টোর করা যাবে। এবং এটাং আমি এডজেন্সী মেট্রিক্স রাখব


    scanf("%d",&N); // এটা হলো  নোড সংখ্যা , এখানে যত বলা হবে তত x তত একটা মেট্রিক্স কল্পনা করে ইনপুট নিতে হবে
    for(int i=0;i<N;i++){
       for(int j=0;j<N;j++) {
            scanf("%d" ,&matrix[i][j]); // যদি প্রথম ইটারেশন চিন্তা করি এটা হলো matrix[100][100] এর matrix[0][0] ইনডেক্স
       }
    }

    //বাকীটা মেট্রিক্স প্রিন্ট দেয়ার জন্য
    for(int i=0;i<N;i++){
       for(int j=0;j<N;j++) {
            cout << matrix[i][j] <<" " ;
       }
       cout <<endl;
    }


    return 0;
}
